emacs/.emacs.d/init.org
# -*- mode: org -*-
#+TITLE:  Emacs configuration in org-mode
#+AUTHOR: Christian Heinrich
#+EMAIL:  com-emacs@gladbachcity.de
#+STARTUP: indent
#+SETUPFILE: ~/org/org-templates/level-1.org
#+INCLUDE:   ~/org/org-templates/level-1.org
#+LANGUAGE:   en
#+TAGS: PLUGIN(p) ORGMODE(o)
#+PROPERTY: header-args:emacs-lisp :tangle init.el

This is my personal emacs configuration, although I took quite a bit from [[http://mescal.imag.fr/membres/arnaud.legrand/misc/init.org][Arnaud Legrand]].
I'm a VIM guy; I hence use evil-mode.

* Load files and important plugins
** ELPA
#+begin_src emacs-lisp
(require 'package)
(package-initialize)
(setq package-archives
'(("ELPA" . "http://tromey.com/elpa/")
   ("gnu" . "http://elpa.gnu.org/packages/")
   ("melpa" . "http://melpa.milkbox.net/packages/")
   ("marmalade" . "http://marmalade-repo.org/packages/")))
#+end_src

To install new packages, use =M-x package-install=.
** Configure load paths                                        

The load-paths for org-mode are added later.

#+begin_src emacs-lisp
(add-to-list 'load-path "~/.emacs.d/elpa/evil-1.0.8")
(add-to-list 'load-path "~/.emacs.d/elpa/ob-lua-20160411.2024")
(add-to-list 'load-path "~/.emacs.d/elpa/typopunct-1.0")
(add-to-list 'load-path "~/.emacs.d/elpa/evil-easymotion-20160617.1840")
#+end_src

** Load org-mode                                                   :ORGMODE:
#+begin_src emacs-lisp
(add-to-list 'load-path "~/.emacs.d/org-mode/lisp/")
(add-to-list 'load-path "~/.emacs.d/org-mode/contrib/lisp/")
(require 'org-install)
(require 'org)
#+end_src

** Load org-protocol for capturing websites easily

Note: This won't work anymore with Firefox 57+, according to https://addons.mozilla.org/en-US/firefox/addon/org-mode-capture/ but it seems that there is now
an alternative: https://addons.mozilla.org/en-US/firefox/addon/org-capture/. Check the GitHub page for setup.

#+BEGIN_SRC 
(server-start)
(require 'org-protocol)
#+END_SRC

** Filetypes / emacs modes
#+begin_src emacs-lisp
(setq auto-mode-alist
   (append (mapcar 'purecopy
      '(("\\.c$"   . c-mode)
        ("\\.h$"   . c-mode)
        ("\\.c.simp$" . c-mode)
        ("\\.h.simp$" . c-mode)
        ("\\.a$"   . c-mode)
        ("\\.w$"   . cweb-mode)
        ("\\.cc$"   . c++-mode)
        ("\\.S$"   . asm-mode)
        ("\\.s$"   . asm-mode)
        ("\\.p$"   . pascal-mode)
        ("\\.Rmd$" . poly-markdown-mode)
        ("\\.pas$" . pascal-mode)
        ("\\.tex$" . LaTeX-mode)
        ("\\.txi$" . Texinfo-mode)
        ("\\.el$"  . emacs-lisp-mode)
        ("emacs"  . emacs-lisp-mode)
        ("\\.ml[iylp]?" . tuareg-mode)
        ("[mM]akefile" . makefile-mode)
        ("[mM]akefile.*" . makefile-mode)
        ("\\.mak" . makefile-mode)
        ("\\.cshrc" . sh-mode)
        ("\\.html$" . html-mode)
        ("\\.org$" . org-mode)
)) auto-mode-alist))
#+end_src
* Emacs GUI
** Theme

#+begin_src emacs-lisp
  (load-theme 'tango-dark t)
#+end_src

** Disable splash screen
#+begin_src emacs-lisp
(setq inhibit-splash-screen t)
#+end_src

** Change frame name of emacs

#+begin_src emacs-lisp
(setq frame-title-format
  '("Emacs - " (buffer-file-name "%f"
    (dired-directory dired-directory "%b"))))
#+end_src

** Disable tool-bar

#+begin_src emacs-lisp
;;(scroll-bar-mode 0)
(tool-bar-mode -1)
#+end_src


** TODO Line and column numbering       
#+begin_src emacs-lisp
(line-number-mode 1)
(column-number-mode 1)
#+end_src

** TODO Parenthesis
#+begin_src emacs-lisp
(load-library "paren")
(show-paren-mode 1)
;;(transient-mark-mode t)
(require 'paren)
#+end_src


* Keyboard ad mouse 
** Scroll one line at a time (when using the mouse wheel)

#+BEGIN_SRC emacs-lisp
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))
#+END_SRC

** Load emacs initialization file:                                     :LUKA:
#+begin_src emacs-lisp
(global-set-key (kbd "C-c i") 
(lambda() (interactive)(org-babel-load-file "~/.emacs.d/init.org")))
#+end_src
[16:28:10; 24.04.2013]

** Change font size                                              :CHRISTIAN:

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-+") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
#+END_SRC

[2017-02-15 Wed]

** UTF 8 by default                                                 :ARNAUD:
#+begin_src emacs-lisp
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
#+end_src
** Keyboard fix for Mac OS X users...                               :ADRIEN:
Thanks to Adrien Lebre for providing me with this
ns-use-mac-modifier-symbols thing. Unfortunately, this is broken at
the moment (I tried to wrap the command around the cond but it should
fail on mac). 
#+begin_src emacs-lisp
(cond
 ((string-equal system-type "darwin")   ; Mac OS X
  (progn
    (setq
     ns-command-modifier 'meta         ; Apple/Command key is Meta
         ns-alternate-modifier nil         ; Option is the Mac Option key
         ns-use-mac-modifier-symbols  nil  ; display standard Emacs (and not standard Mac) modifier symbols
         ))
  )
 )
#+end_src
** CUA mode a.k.a C-x, C-c, C-v 
Yuck! Many people like this but I hate it as it conflicts with some of
my other shortcuts (e.g., the ones for spelling a region).
#+begin_src emacs-lisp
;; (cua-mode t)
#+end_src
** Hide/show the C block:                                          :LUKA:WEB:
#+begin_src emacs-lisp
(add-hook 'c-mode-common-hook
  (lambda()
    (local-set-key (kbd "C-c <right>") 'hs-show-block)
    (local-set-key (kbd "C-c <left>")  'hs-hide-block)
    (local-set-key (kbd "C-c <up>")    'hs-hide-all)
    (local-set-key (kbd "C-c <down>")  'hs-show-all)
    (hs-minor-mode t)))
#+end_src
[16:32:57; 24.04.2013]

** Reload buffer:                                                   :ARNAUD:
#+begin_src emacs-lisp
(global-set-key [f5] '(lambda () (interactive) (revert-buffer nil t nil)))
#+end_src
[16:34:57; 24.04.2013]
** Compile / Make
#+begin_src emacs-lisp
(global-set-key "\^x\^e" 'compile)
#+end_src
** Navigate back in text                                             :ARNAUD:
#+begin_src emacs-lisp
(defun jump-mark ()
  (interactive)
  (set-mark-command (point)))
(defun beginning-of-defun-and-mark ()
  (interactive)
  (push-mark (point))
  (beginning-of-defun))
(defun end-of-defun-and-mark ()
  (interactive)
  (push-mark (point))
  (end-of-defun))

(global-set-key "\^c\^b" 'beginning-of-defun-and-mark)
(global-set-key "\^c\^e" 'end-of-defun-and-mark)
(global-set-key "\^c\^j" 'jump-mark)
(global-set-key [S-f6] 'jump-mark)              ;; jump from mark to mark
#+end_src
** Goto line                                                         :ARNAUD:
#+begin_src emacs-lisp
(global-set-key "\M-g" 'goto-line)
#+end_src
** Use X clipboard (cut'n paste)                                        :WEB:
   Since I switched to emacs 24, cutting and pasting to emacs has
   become burdensome. For example, I had to do S-C-c after selecting
   terminals areas before being able to copy in emacs. With the
   following commants, I don't have to do this anymore. I wish it
   would have eased interactions when running emacs in a terminal
   (i.e., with -nw) but it does not. :( http://stackoverflow.com/questions/13036155/how-to-to-combine-emacs-primary-clipboard-copy-and-paste-behavior-on-ms-windows
#+begin_src emacs-lisp
(setq select-active-regions nil)
(setq x-select-enable-primary t)
(setq x-select-enable-clipboard t)
(setq mouse-drag-copy-region t)
#+end_src
** Cut'n paste in no-window mode                              :noexport:WEB:
   Despite what can be found in many old discussions on emacs mailing
   lists, it seems to be possible and the trick is to use xclip!
http://stackoverflow.com/questions/4580835/emacs-copy-kill-ring-to-system-clipboard-in-nowindow-mode   http://stackoverflow.com/questions/5288213/how-can-i-paste-the-selected-region-outside-of-emacs/14659015#14659015

If you simply use the following commands, then emacs cut-n-paste works
just perfectly with the X clipboard. I can select in emacs no window
and then paste with the middle-click button! :) Many thanks to Vijay
for pointing me out that I had forgotten the "require" line... :)
#+begin_src emacs-lisp
;;  (if(string-equal system-type "gnu/linux")   ; Linux!
;;      (
      ;; (require (quote xclip))
      ;; (xclip-mode 1)
;;      )()
;;        )
#+end_src
** Increase/decrease text size in emacs                                :WEB:
#+begin_src emacs-lisp
(global-set-key (kbd "C-+") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
;; C-x C-0 restores the default font size
#+end_src
[11:26:47; 18.04.2014]
** Add spell checker to the file                                       :WEB:
#+begin_src emacs-lisp
;; Inspired from http://tex.stackexchange.com/questions/166681/changing-language-of-flyspell-emacs-with-a-shortcut
;; (defun spell (choice)
;;    "Switch between language dictionaries."
;;    (interactive "cChoose:  (a) American | (f) Francais")
;;     (cond ((eq choice ?1)
;;            (setq flyspell-default-dictionary "american")
;;            (setq ispell-dictionary "american")
;;            (ispell-kill-ispell))
;;           ((eq choice ?2)
;;            (setq flyspell-default-dictionary "francais")
;;            (setq ispell-dictionary "francais")
;;            (ispell-kill-ispell))
;;           (t (message "No changes have been made."))) )

(define-key global-map (kbd "C-c s a") (lambda () (interactive) (ispell-change-dictionary "american")))
(define-key global-map (kbd "C-c s f") (lambda () (interactive) (ispell-change-dictionary "francais")))
(define-key global-map (kbd "C-c s r") 'flyspell-region)
(define-key global-map (kbd "C-c s b") 'flyspell-buffer)
(define-key global-map (kbd "C-c s s") 'flyspell-mode)
#+end_src
** Invoke magit (for git)                                              :WEB:
From http://magit.vc/manual/magit.pdf

#+begin_src emacs-lisp
(global-set-key (kbd "C-x g") 'magit-status)
(global-set-key (kbd "C-x M-g") 'magit-dispatch-popup)
;; (global-magit-file-mode 1)
#+end_src

* Small fixes:
** PDF with LaTeX by default                                        :ARNAUD:
#+begin_src emacs-lisp
(defun auto-fill-mode-on () (TeX-PDF-mode 1))
(add-hook 'tex-mode-hook 'TeX-PDF-mode-on)
(add-hook 'latex-mode-hook 'TeX-PDF-mode-on)
(setq TeX-PDF-mode t)
#+end_src
