emacs/.emacs.d/init.org
* Org-mode capture                                        :ORGMODE:CHRISTIAN:

#+begin_src emacs-lisp
;; http://stackoverflow.com/questions/9005843/interactively-enter-headline-under-which-to-place-an-entry-using-capture
(defun Shurakai/find-journal-tree ()
  (defconst Shurakai/journal-headline-format "[%Y-%m-%d %a]")
  (setq headline (format-time-string Shurakai/journal-headline-format))
  (goto-char (point-min)) ;; Go to the very beginning of the file
  (re-search-forward (format-time-string "\* %Y")) ;; Find the heading with the right year
  (outline-show-children) ;; and open it (otherwise, the next search doesn't find anything?)
  (if (re-search-forward  ;; see https://www.gnu.org/software/emacs/manual/html_node/eintr/re_002dsearch_002dforward.html
     (format org-complex-heading-regexp-format (regexp-quote headline)) 
     nil t)
     (goto-char (point-at-bol)) ;; then
     (goto-char (point-max))    ;; else
     (insert "** " headline))   ;; also else
  (org-end-of-subtree))
#+end_src

* Org-mode LaTeX export
** ACM                                                              :ARNAUD:
#+begin_src emacs-lisp
 (unless (boundp 'org-latex-classes) (setq org-latex-classes nil))

 (add-to-list 'org-latex-classes '("acm-proc-article-sp" "\\documentclass{acm_proc_article-sp}\n \[NO-DEFAULT-PACKAGES]\n \[EXTRA]\n  \\usepackage{graphicx}\n  \\usepackage{hyperref}"  ("\\section{%s}" . "\\section*{%s}") ("\\subsection{%s}" . "\\subsection*{%s}")                       ("\\subsubsection{%s}" . "\\subsubsection*{%s}")                       ("\\paragraph{%s}" . "\\paragraph*{%s}")                       ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

 (setq org-latex-to-pdf-process '("pdflatex -interaction nonstopmode -output-directory %o %f ; bibtex `basename %f | sed 's/\.tex//'` ; pdflatex -interaction nonstopmode -output-directory  %o %f ; pdflatex -interaction nonstopmode -output-directory %o %f"))
#+end_src
** General articles                                                    :LUKA:
I'm not completely sure I need this. I could probably remove it...
#+begin_src emacs-lisp
(add-to-list 'org-latex-classes '("article" "\\documentclass{article}\n \[NO-DEFAULT-PACKAGES]\n \[EXTRA]\n  \\usepackage{graphicx}\n  \\usepackage{hyperref}"  ("\\section{%s}" . "\\section*{%s}") ("\\subsection{%s}" . "\\subsection*{%s}")                       ("\\subsubsection{%s}" . "\\subsubsection*{%s}")                       ("\\paragraph{%s}" . "\\paragraph*{%s}")                       ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
#+end_src

#+RESULTS:...

[15:18:27; 16.05.2013]
* Org-mode for github                                              :noexport:
** toc-org
toc-org helps you to have an up-to-date table of contents in org files
without exporting (useful primarily for readme files on GitHub).
#+begin_src emacs-lisp
;;(if (require 'org-toc nil t)
;;    (add-hook 'org-mode-hook 'toc-org-enable)
;;  (warn "toc-org not found"))
#+end_src
Now, every time I save an org file, the first headline with a :TOC:
tag will be updated with the current table of contents.
* Org-ref                                                     :LUKA:noexport:
# This seems to break my export
# Following what is explained at https://github.com/jkitchin/jmax/blob/master/org/org-ref.org
# #+begin_src emacs-lisp
#   (require 'reftex-cite)
#   (require 'dash)
#   (load "~/.emacs.d/elpa/org-ref/org-ref.el")
# #+end_src
# And a convenient shortcut from Luka:
# #+begin_src emacs-lisp
#   (global-set-key (kbd "C-c )") 'org-ref-insert-cite-link)
# #+end_src
* Org-mode mobile                                                  :noexport:
** Setup
#+begin_src emacs-lisp
;; Set to the name of the file where new notes will be stored
(setq org-mobile-inbox-for-pull "~/org/flagged.org")
;; Set to <your Dropbox root directory>/MobileOrg.
(setq org-mobile-directory "~/Dropbox/Apps/MobileOrg")
#+end_src
* Org-mode custom stuff                                            :noexport:
** Epresent
#+begin_src emacs-lisp
;; (require 'epresent)
#+end_src
* Org-mode website generation                                      :noexport:
You may want to fully disable this section if you consider using my
init.org as it is really full of custom hardcoded stuff not really
meant to be usable as such.
