emacs/.emacs.d/init.el

(require 'htmlize)
;; (require 'org-publish) ;;; this is obsolete! do not call this or you will regret it at some point!
(defun sr-org-notes-sitemap-complete ()
  "Take the sitemap-file and turn it into the menu-structure file for Marco Pratesi's phplayersmenu."
  (let* ((base-dir (file-name-as-directory (plist-get project-plist :base-directory)))
         (orig (expand-file-name (concat base-dir (plist-get project-plist :sitemap-filename))))
         (strip-suffix (or (plist-get project-plist :base-extension) "org"))
         (add-suffix (or (plist-get project-plist :html-extension) "html"))
         (link-target (or (plist-get project-plist :menu/link-target) "_blank"))
         (menu-file (or (plist-get project-plist :menu/structure-file) nil))

         (visiting (find-buffer-visiting orig))
         (visiting-output (find-buffer-visiting menu-file))

         (input-buffer (find-file orig))
         (output-buffer (find-file menu-file))

         (old-ndots 1)
         (sub "")
         (old-sub ""))

    (unless menu-file
      (throw 'sr-org-note-kb-completion-error
             "No menu structure file provided. Giving up."))

    (with-current-buffer output-buffer
      (erase-buffer))

    (with-current-buffer input-buffer
      (widen)
      (goto-char (point-min))
      (while (re-search-forward org-bracket-link-analytic-regexp (point-max) t)
        (let ((link (match-string-no-properties 3))
              (text (match-string-no-properties 5))
              (pos 0)
              (ndots 1))

      (with-current-buffer output-buffer
        (if (string-match (concat "\\(" strip-suffix "\\)$") link)
            (setq link (replace-match add-suffix t t link)))
        (while (setq pos (string-match "/" link pos))
          (setq ndots (+ ndots 1))
          (setq pos (+ pos 1)))

        (when (< 1 ndots)
          (string-match "\\(/[^/]*\\)$" link)
          (setq sub (replace-match "" t t link))

          (unless (string= sub old-sub)
            (let ((ds 0)
                  (subs (split-string sub "/"))
                  (old-subs (split-string old-sub "/")))
              (while (string= (car old-subs) (car subs))
                (setq ds (+ ds 1))
                (pop old-subs)
                (pop subs))
              (dolist (d subs)
                (setq ds (+ ds 1))
                (insert
                 (concat
                  (make-string ds ?.) "|" d "\n")))
              (setq old-sub sub))))

        (insert
         (concat
          (make-string ndots ?.) "|" text "|" link "|||" link-target "\n"))
        (setq old-ndots ndots)
        ))))

    (or visiting (kill-buffer input-buffer))

    (with-current-buffer output-buffer
      (save-buffer))
    (or visiting-output (kill-buffer output-buffer))
))

;; stolen from http://orgmode.org/worg/sources/emacs.el
(eval-after-load "ox-html"
'(setq org-html-scripts
       (concat org-html-scripts "\n"
               "<script type=\"text/javascript\">
    function rpl(expr,a,b) {
      var i=0
      while (i!=-1) {
         i=expr.indexOf(a,i);
         if (i>=0) {
            expr=expr.substring(0,i)+b+expr.substring(i+a.length);
            i+=b.length;
         }
      }
      return expr
    }

    function show_org_source(){
       document.location.href = rpl(document.location.href,\".php\",\".org\");
    }
</script>
")))


(setq org-html-htmlize-output-type 'css)

(setq org-publish-project-alist
      '(
("org-notes"
 :base-directory "~/org/public_html/"
 :base-extension "org"
 :html-extension "php"
 :htmlize-output-type "css"
 :htmlized-source t
 :publishing-directory "~/public_html/org/"
 :recursive t
 :publishing-function (org-html-publish-to-html org-org-publish-to-org)
 :headline-levels 4             ; Just the default for this project.
 :auto-preamble t
 :auto-sitemap t                ; Generate sitemap.org automagically...
 :sitemap-filename "sitemap-generated.org"
 :sitemap-title "Sitemap"         ; ... with title 'Sitemap'. 
 :sitemap-sort-files "alphabetically"
 :sitemap-sort-folders "last"
 :sitemap-ignore-case t
;;; tree menus
 :sitemap-style "tree"
 :exclude "sitemap.org"
 ;; Layersmenu:
 :completion-function sr-org-notes-sitemap-complete
 :menu/structure-file "~/org/public_html/menu-structure-file.txt"
 :menu/link-target "_self" ;; optional
 :html-postamble "<div id=\"show_source\"><input type=\"button\" value=\"Show Org source\" onClick='show_org_source()'></div>"
;; :body-only t ;; Only export section between <body> </body>
)
("org-static"
 :base-directory "~/org/public_html/"
 :base-extension "css\\|js\\|ijs\\|svg\\|jpeg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|css\\|php\\|html\\|jpg\\|png\\|gif\\|zip\\|pdf\\|ps\\|ps.gz\\|tar.gz\\|tgz\\|c\\|ml\\|txt\\|avi\\|bib\\|m\\|tex\\|exe\\|dat\\|R\\|csv\\|htaccess"
 :publishing-directory "~/public_html/org/"
 :recursive t
 :publishing-function org-publish-attachment
 )
 ("org-sources"
  :base-directory  "~/org/public_html/"
  :base-extension "org"
  :publishing-directory "~/public_html/org/"
  :recursive t
  :publishing-function org-publish-attachment)
 ("org" :components ("org-notes" "org-static" "org-sources"))
      ))

(defun org-publish-current-file-custom () 
  (interactive)
  (setq org-export-babel-evaluate nil) ;; do not run babel!
  (org-publish-current-file) 
  (shell-command "make -C ~/org/public_html publish-light")
)

(global-set-key [f6] 'org-publish-current-file-custom)

(defun org-publish-all-custom ()
   (setq org-export-babel-evaluate nil) ;; do not run babel!
   (org-publish-all)  ;; passing t to org-publish-all forces to regenerate everything
   (kill-emacs 0)
   )

;;  (add-to-list 'load-path "/usr/share/org-mode/lisp/")
;; (require 'ox-freemind)

(require 'ox-md)

(require 'tramp)
(setq tramp-default-method "scp")

(require 'recentf)
    (recentf-mode 1)
    (setq recentf-max-menu-items 25)
    (global-set-key "\C-x\ \C-r" 'recentf-open-files)

(defun undo-kill-buffer (arg)
  "Re-open the last buffer killed.  With ARG, re-open the nth buffer."
  (interactive "p")
  (let ((recently-killed-list (copy-sequence recentf-list))
         (buffer-files-list
          (delq nil (mapcar (lambda (buf)
                              (when (buffer-file-name buf)
                                (expand-file-name (buffer-file-name buf)))) (buffer-list)))))
    (mapc
     (lambda (buf-file)
       (setq recently-killed-list
             (delq buf-file recently-killed-list)))
     buffer-files-list)
    (find-file
     (if arg (nth arg recently-killed-list)
       (car recently-killed-list)))))
(global-set-key (kbd "C-S-t") 'undo-kill-buffer)

(require 'evil)
(require 'evil-easymotion)
(evil-mode 1)

(custom-set-variables
