emacs/.emacs.d/init.org
* Custom-set variables                                            :CHRISTIAN:

I set these variables via the GUI but I don't know how to set them
here.

#+BEGIN_SRC emacs-lisp
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 ;;'(custom-enabled-themes (quote (tango-dark)))
 '(line-number-mode nil)
 '(org-agenda-files
   (quote
    ("~/Documents/Notizen/privat.org" "~/org/journal_privat.org" "~/workspace/inria/research-collab/journal.org")))
 '(org-agenda-ndays 7)
 '(org-agenda-show-all-dates t)
 '(org-agenda-skip-deadline-if-done t)
 '(org-agenda-skip-scheduled-if-done t)
 '(org-agenda-start-on-weekday nil)
 '(org-babel-exp-inline-code-template "src_%lang[%switches%flags]{}")
 '(org-babel-shell-names
   (quote
    ("sh" "bash" "csh" "ash" "dash" "ksh" "mksh" "posh" "zsh")))
 '(org-deadline-warning-days 14)
 '(org-default-notes-file "/tmp/notes.org")
 '(org-hide-leading-stars t)
 '(org-latex-table-caption-above nil)
 '(org-remember-store-without-prompt t)
 '(org-remember-templates
   (quote
    ((116 "* TODO %?
  %u" "~/Documents/Notizen/privat.org" "Tasks")
     (110 "* %u %?" "/tmp/notes.org" "Notes"))))
 '(org-reverse-note-order t)
 '(package-selected-packages
   (quote
    (magit helm dash-functional typopunct ob-lua lua-mode evil-org evil-easymotion ess epresent color-theme-sanityinc-tomorrow color-theme)))
 '(remember-annotation-functions (quote (org-remember-annotation)))
 '(remember-handler-functions (quote (org-remember-handler)))
 '(safe-local-variable-values
   (quote
    ((org-emphasis-alist
      ("*" bold)
      ("/" italic)
      ("_" nil)
      ("=" org-verbatim verbatim)
      ("~" org-code verbatim)
      ("+"
       (:strike-through nil)))
     (org-emphasis-alist
      ("*" bold)
      ("/" italic)
      ("__" underline)
      ("=" org-verbatim verbatim)
      ("~" org-code verbatim)
      ("+"
       (:strike-through nil)))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'remember)
(evilem-default-keybindings ",")
;; Escape on jj
(defun escape-if-next-char (c)
  "Watches the next letter.  If c, then switch to Evil's normal mode; otherwise insert a k and forward unpressed key to unread-command events"
  (self-insert-command 1)
  (let ((next-key (read-event)))
	(if (= c next-key)
	  (progn
		(delete-backward-char 1)
		(evil-esc 1))
	  (setq unread-command-events (list next-key)))))
(defun escape-if-next-char-is-j (arg)
  (interactive "p")
  (if (= arg 1)
	(escape-if-next-char ?j)
	(self-insert-command arg)))
 
(define-key evil-insert-state-map (kbd "j") 'escape-if-next-char-is-j)
(setq org-use-sub-superscripts "{}")

(eval-after-load "org"
  '(progn
     (require 'typopunct)
     (typopunct-change-language 'english)
     (typopunct-mode t)))

(with-eval-after-load 'ox-latex
   (add-to-list 'org-latex-classes
        '("articleA"
          "\\documentclass[12pt,a4paper,oneside,smallheadings,pointlessnumbers,BCOR12mm,DIVcalc]{scrreprt}%aus dem KOMA-Script-Paket"
          ("\\chapter{%s}" . "\\chapter*{%s}")
          ("\\section{%s}" . "\\section*{%s}")
          ("\\subsection{%s}" . "\\subsection*{%s}")
          ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
          ("\\paragraph{%s}" . "\\paragraph*{%s}")
          ("\\subparagraph{%s}" . "\\subparagraph*{%s}")
        )))

#+END_SRC

#+BEGIN_SRC emacs-lisp
;;        (org-babel-tangle-file "~/.emacs.d/init.org"
;;                               "~/.emacs.d/init.el"
;;                               "emacs-lisp")
(global-set-key (kbd "C-x x") 'execute-extended-command)
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )
#+END_SRC

#+RESULTS:

